# Import

In [40]:
import pandas as pd

# Read dataset
file_path = "Study Case DA.xlsx"

In [41]:
# Menampilkan semua kolom tanpa terpotong
pd.set_option('display.max_columns', None)

# Dataframe & Sheets

In [42]:
employees = pd.read_excel(file_path, sheet_name="employees")
performance = pd.read_excel(file_path, sheet_name="performance_yearly")
competencies = pd.read_excel(file_path, sheet_name="competencies_yearly")
profiles = pd.read_excel(file_path, sheet_name="profiles_psych")
papi = pd.read_excel(file_path, sheet_name="papi_scores")
strength = pd.read_excel(file_path, sheet_name="strengths")

In [43]:
display(employees.head())
display(performance.head())
display(competencies.head())
display(profiles.head())
display(papi.head())
display(strength.head())

,employee_id,fullname,nip,company_id,area_id,position_id,department_id,division_id,directorate_id,grade_id,education_id,major_id,years_of_service_months
0,EMP100000,Rendra Pratama,806137,1,4,1,6,3,3,2,3,1,64
1,EMP100001,Wulan Setiawan,476388,4,4,4,5,5,3,1,1,2,16
2,EMP100002,Julia Jatmiko Situmorang,941921,1,3,5,1,1,3,1,3,1,58
3,EMP100003,Oka Halim,751615,1,3,4,2,1,1,2,2,5,15
4,EMP100004,Dwi Pratama,443809,3,4,6,5,3,3,1,1,5,34

  employee_id  rating  year
0   EMP100000     2.0  2021
1   EMP100001     NaN  2021
2   EMP100002     2.0  2021
3   EMP100003     NaN  2021
4   EMP100004     3.0  2021

  employee_id  score pillar_code  year
0   EMP100000    2.0         GDR  2021
1   EMP100001    NaN         GDR  2021
2   EMP100002    1.0         GDR  2021
3   EMP100003    NaN         GDR  2021
4   EMP100004    3.0         GDR  2021

,employee_id,pauli,faxtor,disc,disc_word,mbti,iq,gtq,tiki
0,EMP100000,86,75,SI,Steadiness-Influencer,NaN,94.0,33.0,2
1,EMP100001,48,52,DS,Dominant-Steadiness,INTP,94.0,17.0,3
2,EMP100002,66,38,DC,Dominant-Conscientious,NaN,109.0,20.0,3
3,EMP100003,39,63,SI,Steadiness-Influencer,ENTJ,85.0,39.0,3
4,EMP100004,75,100,NaN,Steadiness-Conscientious,INTJ,134.0,21.0,9

  employee_id scale_code  score
0   EMP100000     Papi_N    2.0
1   EMP100001     Papi_N    8.0
2   EMP100002     Papi_N    9.0
3   EMP100003     Papi_N    9.0
4   EMP100004     Papi_N    7.0

  employee_id  rank           theme
0   EMP100000     1             NaN
1   EMP100001     1  Responsibility
2   EMP100002     1     Restorative
3   EMP100003     1          Belief
4   EMP100004     1    Deliberative

In [44]:
pillars = pd.read_excel(file_path, sheet_name="dim_competency_pillars")

dim_grades = pd.read_excel(file_path, sheet_name="dim_grades")
dim_directorates = pd.read_excel(file_path, sheet_name="dim_directorates")
dim_divisions = pd.read_excel(file_path, sheet_name="dim_divisions")
dim_departments = pd.read_excel(file_path, sheet_name="dim_departments")
dim_positions = pd.read_excel(file_path, sheet_name="dim_positions")
dim_education = pd.read_excel(file_path, sheet_name="dim_education")
dim_majors = pd.read_excel(file_path, sheet_name="dim_majors")
dim_areas = pd.read_excel(file_path, sheet_name="dim_areas")
dim_companies = pd.read_excel(file_path, sheet_name="dim_companies")

In [45]:
# Buat dictionary mapping dari setiap tabel dimensi
map_company = dict(zip(dim_companies["company_id"], dim_companies["name"]))
map_area = dict(zip(dim_areas["area_id"], dim_areas["name"]))
map_position = dict(zip(dim_positions["position_id"], dim_positions["name"]))
map_department = dict(zip(dim_departments["department_id"], dim_departments["name"]))
map_division = dict(zip(dim_divisions["division_id"], dim_divisions["name"]))
map_directorate = dict(zip(dim_directorates["directorate_id"], dim_directorates["name"]))
map_grade = dict(zip(dim_grades["grade_id"], dim_grades["name"]))
map_education = dict(zip(dim_education["education_id"], dim_education["name"]))
map_major = dict(zip(dim_majors["major_id"], dim_majors["name"]))

# Duplikasi data asli agar tidak mengubah 'employees'
employees_name = employees.copy()

# Mapping ID → Nama
employees_name["company_id"] = employees_name["company_id"].map(map_company)
employees_name["area_id"] = employees_name["area_id"].map(map_area)
employees_name["position_id"] = employees_name["position_id"].map(map_position)
employees_name["department_id"] = employees_name["department_id"].map(map_department)
employees_name["division_id"] = employees_name["division_id"].map(map_division)
employees_name["directorate_id"] = employees_name["directorate_id"].map(map_directorate)
employees_name["grade_id"] = employees_name["grade_id"].map(map_grade)
employees_name["education_id"] = employees_name["education_id"].map(map_education)
employees_name["major_id"] = employees_name["major_id"].map(map_major)

# Ubah nama kolom menjadi lebih deskriptif
employees_name = employees_name.rename(columns={
    "company_id": "company_name",
    "area_id": "area_name",
    "position_id": "position_name",
    "department_id": "department_name",
    "division_id": "division_name",
    "directorate_id": "directorate_name",
    "grade_id": "grade_name",
    "education_id": "education_name",
    "major_id": "major_name"
})

display(employees_name.head())

,employee_id,fullname,nip,company_name,area_name,position_name,department_name,division_name,directorate_name,grade_name,education_name,major_name,years_of_service_months
0,EMP100000,Rendra Pratama,806137,PT Aurora Beauty Indonesia,Store,Brand Executive,R&D,Product Dev,Technology,IV,S2,Business,64
1,EMP100001,Wulan Setiawan,476388,PT Mandala Distribution Center,Store,HRBP,Operations,Talent Management,Technology,III,D3,Design,16
2,EMP100002,Julia Jatmiko Situmorang,941921,PT Aurora Beauty Indonesia,Plant,Sales Supervisor,Finance,Digital Marketing,Technology,III,S2,Business,58
3,EMP100003,Oka Halim,751615,PT Aurora Beauty Indonesia,Plant,HRBP,HR,Digital Marketing,Commercial,IV,S1,Psychology,15
4,EMP100004,Dwi Pratama,443809,PT Lumo Cosmetics Asia,Store,Supply Planner,Operations,Product Dev,Technology,III,D3,Psychology,34

# EDA

In [46]:
performance_5 = performance[performance["rating"] == 5]


print(performance_5.shape)
display(performance_5)

(881, 3)

      employee_id  rating  year
8       EMP100008     5.0  2021
21      EMP100021     5.0  2021
43      EMP100043     5.0  2021
49      EMP100049     5.0  2021
53      EMP100053     5.0  2021
...           ...     ...   ...
10013   EMP101973     5.0  2025
10014   EMP101974     5.0  2025
10026   EMP101986     5.0  2025
10045     DUP1942     5.0  2025
10048     DUP9801     5.0  2025

[881 rows x 3 columns]

## Contextual factors

In [54]:
performance_employees = (
    performance_5
    .merge(employees, on="employee_id", how="left")
)
display(performance_employees.head())

,employee_id,rating,year,fullname,nip,company_id,area_id,position_id,department_id,division_id,directorate_id,grade_id,education_id,major_id,years_of_service_months
0,EMP100008,5.0,2021,Gita Permadi,189647,2,4,3,1,5,1,1,4,1,40
1,EMP100021,5.0,2021,Oka Candra Kurniawan,828497,3,3,1,4,3,2,3,2,6,81
2,EMP100043,5.0,2021,Nugroho Indrawan,123837,2,2,3,4,2,2,1,1,3,40
3,EMP100049,5.0,2021,Rizki Halim Siregar,453636,1,4,5,1,1,1,3,4,6,35
4,EMP100053,5.0,2021,Anisa Pamungkas,770602,1,3,1,3,3,1,3,3,5,52

In [58]:
import pandas as pd

# Asumsikan data kamu sudah dimuat sebagai performance_employees
# contoh: performance_employees = pd.read_excel(file_path, sheet_name="performance_employees")

# Tentukan tahun terakhir di dataset
LATEST_YEAR = performance_employees['year'].max()

# Hitung masa kerja yang disesuaikan untuk setiap baris
performance_employees['years_of_service_adjusted'] = (
    performance_employees['years_of_service_months']
    - (LATEST_YEAR - performance_employees['year']) * 12
)

# Tampilkan hasil
display(performance_employees.head())

,employee_id,rating,year,fullname,nip,company_id,area_id,position_id,department_id,division_id,directorate_id,grade_id,education_id,major_id,years_of_service_months,years_of_service_adjusted
0,EMP100008,5.0,2021,Gita Permadi,189647,2,4,3,1,5,1,1,4,1,40,-8
1,EMP100021,5.0,2021,Oka Candra Kurniawan,828497,3,3,1,4,3,2,3,2,6,81,33
2,EMP100043,5.0,2021,Nugroho Indrawan,123837,2,2,3,4,2,2,1,1,3,40,-8
3,EMP100049,5.0,2021,Rizki Halim Siregar,453636,1,4,5,1,1,1,3,4,6,35,-13
4,EMP100053,5.0,2021,Anisa Pamungkas,770602,1,3,1,3,3,1,3,3,5,52,4

In [61]:
performance_employees.groupby('grade_id')['years_of_service_adjusted'].describe()

          count       mean        std   min   25%   50%    75%    max
grade_id
1         309.0  28.508091  30.130950 -33.0  6.00  25.0  51.00  125.0
2         294.0  27.697279  28.121146 -31.0  7.25  27.5  46.00  101.0
3         278.0  28.964029  27.568074 -29.0  8.00  27.5  50.75  111.0

In [60]:
pd.crosstab(performance_employees['grade_id'], performance_employees['rating'], normalize='index')

rating    5.0
grade_id
1         1.0
2         1.0
3         1.0